
//Упражнение 1.7. Напишите программу, печатающую значение EOF.


#include <stdio.h>

int main() {
    printf("Значение EOF: %d\n", EOF);

    return 0;
}
